InformationRegisters/НастройкиПолученияУведомленийОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПолученияУведомленийОбЭЛН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучатьУведомленияОбЭЛН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СообщенияФССОбИзмененииСостоянийЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СообщенияФССОбИзмененииСостоянийЭЛН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТребуетОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Загружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Последнее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЭЛН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭЛНВФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отсутствие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбработаноВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отсутствие2</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отсутствие3</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СогласияНаУведомленияОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СогласияНаУведомленияОбЭЛН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подписано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтзываСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласиеНаУведомлениеОбЭЛН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласийНаУведомленияОбЭЛН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеОтзываСогласия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеОтзываСогласия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СогласиеНаУведомлениеОбЭЛН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СогласиеНаУведомлениеОбЭЛН</Name>
			<BasedOn>
				<xr:Item>Document.ПриемНаРаботу</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСтрахователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдресСтрахователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОбработкуПерсональныхДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИООтветственногоЗаОбработкуПерсональныхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПодписалСогласие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/СЭДОФССРасширенныйКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму настроек организации в части социального ЭДО.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация, для которой необходимо показать настройки.
//
Процедура ОткрытьНастройкиПолученияУведомленийОбЭЛН(Страхователь) Экспорт
	Измерения = Новый Структура("Страхователь", Страхователь);
	ПараметрыЗаписи = Новый Массив(1);
	ПараметрыЗаписи[0] = Измерения;
	КлючРегистра = Новый(Тип("РегистрСведенийКлючЗаписи.НастройкиПолученияУведомленийОбЭЛН"), ПараметрыЗаписи);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", КлючРегистра);
	ОткрытьФорму("РегистрСведений.НастройкиПолученияУведомленийОбЭЛН.ФормаЗаписи", ПараметрыФормы);
КонецПроцедуры

// Возникает в форме списка регистра СНИЛСВходящихСообщенийСЭДО при переходе по гиперссылке.
//
// Параметры:
//   ТекущаяСтрока - ДанныеФормыСтруктура - Сведения из сообщения СЭДО.
//   СтандартнаяОбработка - Булево
//
Процедура ПриОткрытииФормыСпискаСообщений111(ТекущаяСтрока, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НомерЛН",                ТекущаяСтрока.НомерЛН);
	ПараметрыФормы.Вставить("ГоловнаяОрганизация",    ТекущаяСтрока.ГоловнаяОрганизация);
	ПараметрыФормы.Вставить("ИдентификаторСообщения", ТекущаяСтрока.ИдентификаторСообщения);
	ПараметрыФормы.Вставить("ФизическоеЛицо",         ТекущаяСтрока.ФизическоеЛицо);
	ОткрытьФорму("РегистрСведений.СообщенияФССОбИзмененииСостоянийЭЛН.ФормаСписка", ПараметрыФормы, , Истина, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Открывает диалог отключения подписки организации на уведомления ФСС об изменении состояний ЭЛН сотрудника
//
// Параметры:
//   Сотрудники - Массив, СправочникСсылка.Сотрудники - Сотрудники, для которых необходимо отключить подписки.
//
Процедура ОтключитьПодписку(Сотрудники) Экспорт
	ИзменитьПодписку(Ложь, Сотрудники);
КонецПроцедуры

// Возвращает признак необходимости обновления группы напоминания ФСС об отключении подписки на ЭЛН.
Функция ТребуетсяОбновитьНапоминаниеОбОтключенииПодпискиНаЭЛН(ИмяСобытия) Экспорт
	Возврат ИмяСобытия = ИмяСобытияПослеИзмененияПодписокНаЭЛН()
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеПолученияСообщенийОтФСС()
		Или ИмяСобытия = "Запись_СогласиеНаУведомлениеОбЭЛН"
		Или ИмяСобытия = "Запись_ОтзывСогласияНаУведомлениеОбЭЛН"
		Или ЭтоСобытиеЗаписиКадровогоПриказа(ИмяСобытия);
КонецФункции

Функция ЭтоСобытиеЗаписиКадровогоПриказа(ИмяСобытия) Экспорт
	Возврат ИмяСобытия = "Запись_ВосстановлениеВДолжности"
		Или ИмяСобытия = "Запись_ЗачислениеВСпискиЧасти"
		Или ИмяСобытия = "Запись_ЗачислениеВСпискиЧастиСписком"
		Или ИмяСобытия = "Запись_ИсключениеИзСписковЧасти"
		Или ИмяСобытия = "Запись_ИсключениеИзСписковЧастиСписком"
		Или ИмяСобытия = "Запись_КадровыйПеревод"
		Или ИмяСобытия = "Запись_КадровыйПереводВоеннослужащего"
		Или ИмяСобытия = "Запись_КадровыйПереводВоеннослужащегоСписком"
		Или ИмяСобытия = "Запись_КадровыйПереводСписком"
		Или ИмяСобытия = "Запись_НазначениеПодработки"
		Или ИмяСобытия = "Запись_НачальнаяШтатнаяРасстановка"
		Или ИмяСобытия = "Запись_ПеремещениеВДругоеПодразделение"
		Или ИмяСобытия = "Запись_ПереносДанных"
		Или ИмяСобытия = "Запись_ПрекращениеПодработки"
		Или ИмяСобытия = "Запись_ПриемНаРаботу"
		Или ИмяСобытия = "Запись_ПриемНаРаботуСписком"
		Или ИмяСобытия = "Запись_Увольнение"
		Или ИмяСобытия = "Запись_УвольнениеСписком";
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ИменаСобытийШироковещательныхОповещений

Функция ИмяСобытияПослеИзмененияПодписокНаЭЛН() Экспорт
	Возврат "ПослеИзмененияПодписокНаУведомленияОбИзмененииСостоянийЭЛН";
КонецФункции

#КонецОбласти

#Область Согласия

Процедура ОткрытьСогласие(Согласие, Организация = Неопределено, Сотрудник = Неопределено) Экспорт
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(Согласие) Тогда
		ПараметрыФормы.Вставить("Ключ", Согласие);
	КонецЕсли;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыФормы.Вставить("Организация", Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ПараметрыФормы.Вставить("Сотрудник", Сотрудник);
	КонецЕсли;
	ОткрытьФорму("Документ.СогласиеНаУведомлениеОбЭЛН.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

Процедура ИзменитьПометкуУдаленияСогласий(МассивСогласий, ПометкаУдаления, Обработчик = Неопределено) Экспорт
	ИзменяемыеСогласия = Новый Массив;
	Для Каждого Согласие Из МассивСогласий Цикл
		СведенияОСогласии = Новый Структура("Ссылка,ПометкаУдаления");
		ЗаполнитьЗначенияСвойств(СведенияОСогласии, Согласие);
		Если ЗначениеЗаполнено(СведенияОСогласии.Ссылка)
			И СведенияОСогласии.ПометкаУдаления <> ПометкаУдаления Тогда
			ИзменяемыеСогласия.Добавить(СведенияОСогласии.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Количество = ИзменяемыеСогласия.Количество();
	Если Количество = 0 Тогда
		Если Обработчик <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Обработчик, Истина);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Количество = 1 Тогда
		ПредставлениеСогласий = Строка(ИзменяемыеСогласия[0]);
	Иначе
		ПредставлениеСогласий = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 согласие;;%1 согласия;%1 согласий;%1 согласия'"), 
			Количество);
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		ТекстВопроса = НСтр("ru = 'После пометки на удаление согласия пропадут из списка.
			|Если сотрудник решил не подписывать согласие,
			|то рекомендуется регистрировать отказ при помощи соответствующей кнопки.
			|
			|Примеры ситуаций, в которых согласия помечаются на удаление:
			|- Согласие утратило свою актуальность (сотрудник его не читал);
			|- Согласие было создано по ошибке.
			|
			|Пометить на удаление %1?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Пометить на удаление'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		КнопкаПоУмолчанию = Неопределено;
	Иначе
		ТекстВопроса = НСтр("ru = 'Снять пометку удаления %1?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Снять пометку удаления'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		КнопкаПоУмолчанию = КодВозвратаДиалога.Да;
	КонецЕсли;
	
	ТекстВопроса = СтрШаблон(ТекстВопроса, ПредставлениеСогласий);
	
	Контекст = Новый Структура;
	Контекст.Вставить("Обработчик", Обработчик);
	Контекст.Вставить("ИзменяемыеСогласия", ИзменяемыеСогласия);
	Контекст.Вставить("ПометкаУдаления", ПометкаУдаления);
	
	ОбработчикОтвета = Новый ОписаниеОповещения(
		"ПослеОтветаНаВопросОбИзмененииПометкиУдаленияСогласий",
		ЭтотОбъект,
		Контекст);
	
	ПоказатьВопрос(ОбработчикОтвета, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию);
КонецПроцедуры

Процедура ПослеОтветаНаВопросОбИзмененииПометкиУдаленияСогласий(Ответ, Контекст) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Если Контекст.Обработчик <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Контекст.Обработчик, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ИзмененныеСогласия = СЭДОФССРасширенныйВызовСервера.ИзменитьПометкуУдаления(Контекст.ИзменяемыеСогласия, Контекст.ПометкаУдаления);
	
	Количество = ИзмененныеСогласия.Количество();
	Если Количество > 0 Тогда
		Если Количество = 1 Тогда
			Если Контекст.ПометкаУдаления Тогда
				Заголовок = НСтр("ru = 'Помечено на удаление'");
			Иначе
				Заголовок = НСтр("ru = 'Снята пометка удаления'");
			КонецЕсли;
			Текст = Строка(ИзмененныеСогласия[0]);
			Ссылка = ПолучитьНавигационнуюСсылку(ИзмененныеСогласия[0]);
		Иначе
			ПредставлениеСогласий = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';%1 согласие;;%1 согласия;%1 согласий;%1 согласия'"), 
				Количество);
			Если Контекст.ПометкаУдаления Тогда
				Текст = НСтр("ru = '%1 помечено на удаление'");
			Иначе
				Текст = НСтр("ru = 'Снята пометка удаления %1'");
			КонецЕсли;
			Текст = СтрШаблон(Текст, ПредставлениеСогласий);
			Ссылка = Неопределено;
		КонецЕсли;
		ПоказатьОповещениеПользователя(Заголовок, Ссылка, Текст, БиблиотекаКартинок.Успешно32);
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(ИзмененныеСогласия);
	
	Если Контекст.Обработчик <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Контекст.Обработчик, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Подписки

// Открывает диалог изменения подписки.
//
// Параметры:
//   ВключитьПодписку - Булево - Если Истина, то подписка будет включена. Если Ложь, то отключена.
//   МассивОснований - СправочникСсылка.Сотрудники,
//       Массив из СправочникСсылка.Сотрудники,
//       Массив из ДокументСсылка.СогласиеНаУведомлениеОбЭЛН - Основания заполнения списка физлиц и страхователей.
//
Процедура ИзменитьПодписку(ВключитьПодписку, МассивОснований) Экспорт
	ПараметрыФормы = Новый Структура("ВключитьПодписку, МассивОснований", ВключитьПодписку, МассивОснований);
	НеИскатьРанееОткрытуюФорму = Истина;
	БлокироватьОкноВладельца = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("РегистрСведений.СогласияНаУведомленияОбЭЛН.Форма.ИзменениеСоставаПодписок",
		ПараметрыФормы,
		,
		НеИскатьРанееОткрытуюФорму,
		,
		,
		,
		БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
